/**
**********************************************************************
* @file		Sample3-1.h
* @brief	浅くC言語 を学ぶためのサンプル3-1
* @date		2021/04/13
* @par		Copyright
  (c) 2019-2021 Bunya
**********************************************************************
*	@par	History
*			- 2019-06-25 Bunya
*				-# 新規作成
*			- 2021-04-13 Bunya
*				-# ミスや誤解を招く内容を訂正。
*
**********************************************************************
*/
// 大枠：要素指示子付きの初期化、複合リテラル、サイズ0配列、文字列リテラル、可変長マクロ、VLA

#pragma once

/************************** 要素指示子付きの初期化 ***************************/
void Sample31Func1(void);

/************************** 複合リテラル ***************************/
void Sample31Func2(void);

/************************** サイズ0配列 ***************************/
void Sample31Func3(void);

/************************** 文字列リテラル ***************************/
void Sample31Func4(void);

/************************** 可変個数引数マクロ ***************************/
void Sample31Func5(void);

/************************** VLA ***************************/
void Sample31Func6(int);
