/**
**********************************************************************
* @file		Sample4-1.h
* @brief	浅くC言語 を学ぶためのサンプル4-1
* @date		2019/07/07
* @par		Copyright
  (c) 2019-2019 Bunya
**********************************************************************
*	@par	History
*			- 2019-07-07 Bunya
*				-# 新規作成
*
**********************************************************************
*/
// 大枠：ポインタ、関数(値渡し、ポインタ渡し)、動的確保

#pragma once

/************************** ポインタ ***************************/
void Sample41Func1(void);
void Sample41Func2(void);

/************************** 関数(値渡し、ポインタ渡し) ***************************/
void Sample41Func3(void);

/************************** 動的確保 ***************************/
void Sample41Func4(void);
void Sample41Func5(void);

/************************** restrict ***************************/
void Sample41Func6(void);
